[
    {
        "name": "INT101",
        "semester": "current",
        "notes": "على الرغم من ان الجزء النظري يمثل القسم الاكبر من محتوى المادة الا ان نجاح لا يتحقق الا من خلال الفهم لكل الجوانب النظرية والعلمية  لذلك :\n1_ محاضرات الدكتور جمال خليفة او د.عروة الخولي او د.حنان السمان فصول قديمة \n2_ ملفات المادة وحل اسئلة قنوات الاختبار",
        "content": "ستتعلم في هذا المقرر أساسيات شبكات الحاسوب، بما في ذلك أنواع الشبكات، ومكوناتها، والبروتوكولات الأساسية مثل (TCP/IP) التي تنظم عملية الاتصال ونقل البيانات بين الأجهزة.",
        "exam": "يتكون الامتحان من 35 الى 40 سؤال وهو مزيج متنوع يشمل اسئلة عملية ونظرية مع غلبة واضحة للجانب النظري . \nيتسم الامتحان بكونه شاملا لجميل فصول المقرر ويصنف مستواه بين السهل والمتوسط نسبيا . يعد هذا فرصة حقيقية للطلاب حيث ان الدراسة المنظمة والتحضير المنتظم لكل محاور المادة يضمنان تحقيق معدلات مرتفعة",
        "channels": [
            "https://t.me/INT101_TEST",
            "https://t.me/Neven_INT101",
            "https://t.me/INT101_new",
            "https://t.me/int101ahmads23",
            "https://t.me/INT101_Y_M"
        ],
        "sources": [
            "https://youtube.com/playlist?list=PL8s4OGp0649_e_Wbz5MlBgW5rBW-9hD0c&si=L3yWzpglFfMkponx"
        ]
    },
    {
        "name": "IOS101",
        "semester": "current",
        "notes": "حضور محاضرات الدكتور اسعد + دراسة سلايدات المادة \nحضور محاضرات الدكتورة سيرا فصول سابقة لفهم القسم العملي (خوارزميات التشغيل)",
        "content": "يستعرض المقرر المكونات والوظائف الأساسية لأنظمة التشغيل، مثل إدارة الذاكرة، والعمليات، ونظام الملفات. الهدف هو فهم كيفية إدارة نظام التشغيل لموارد الحاسوب ليسمح للبرامج بالعمل بكفاءة.",
        "exam": "يتكون امتحان المادة من 30 الى 35 سؤال وهو امتحان شامل يغطي جميع فصول المقرر . وينقسم الى قسمين : القسم النظري والقسم العملي التطبيقي يتضمن مسائل بسيطة تتطلب تطبيق خوارزميات معينة ويتطلب تحقيق معدلات عالية في هذه المادة فهما عميقا للمفاهيم النظرية بالاضافة للقدرة على تطبيق المفاهيم العملية (خوارزميات التشغيل)",
        "channels": [
            "https://t.me/IOS101TIC",
            "https://t.me/IOS_FCFS_SJF_Priorety_RR",
            "https://t.me/ios101ahmads23"
        ],
        "sources": [
            "https://t.me/IOS_FCFS_SJF_Priorety_RR/7"
        ]
    },
    {
        "name": "IPG203",
        "semester": "current",
        "notes": "حضور محاضرات الدكتور معاذ الخباز وهويدا الداوود والدكتور جهاد العيسى + ملفات المقرر \n+ حل اسئلة قنوات تلغرام",
        "content": "يقدم هذا المقرر منهجية البرمجة كائنية التوجه (OOP)، وهي طريقة متقدمة لتصميم البرمجيات تقوم على محاكاة الكائنات الواقعية. ستتعلم مفاهيم مثل الأصناف، الكائنات، والوراثة لبناء برامج مرنة وقابلة للتوسعة.",
        "exam": "الامتحان متوسط الصعوبة ويتنوع بين الاسئلة النظرية والعملية التي تقيس فهم الطالب للمفاهيم الاساسية وتطبيقها C# ويتكون الامتحان من حوالي 25 سؤالا تغطي الجوانب المفاهيمية والبرمجية للمقرر",
        "channels": [
            "https://t.me/IPG201_TIC_IPG203_BAIT_MXM",
            "https://t.me/TICIPG203"
        ],
        "sources": [
            "https://t.me/IPG201_TIC_IPG203_BAIT_MXM/95",
            "https://youtube.com/playlist?list=PLX1bW_GeBRhAfq0EsDHH4YemBAd6G-H75&si=so98sUptLHnUbS2-",
            "https://youtube.com/playlist?list=PL4K-VuBVuyoXvxPD48LjjBEUGxWxHRHQO&si=9TnUv7YYve_7jsSa"
        ]
    },
    {
        "name": "IOS201",
        "semester": "current",
        "notes": "مقرر المادة مع محاضرات الدكتورة حنان فصول سابقة او الدكتورة الفت بركات + ماضرة الشابتر 5 (RAID) + ملخص المادة + حل اسئلة اختبار",
        "content": "يتناول المقرر أنظمة التشغيل المصممة لإدارة موارد الشبكة والخوادم. ستتعلم كيفية إعداد الخدمات الشبكية، إدارة المستخدمين والصلاحيات، وتأمين البيئات الشبكية.",
        "exam": "يكون امتحان مادة نظم التشغيل الشبكية بشكل رئيسي نظري مع امكانية ورود سؤال او سؤالين عمليين لقياس الفهم التطبيقي للمفاهيم الاساسية . يتكون الامتحان عادة من 25 الى 40 سؤال متنوعا يغطي مختلف محاور المقرر المتعلقة بانظمة التشغيل الشبكية والمخدمات ومراكز المعطيات وامن الشبكات",
        "channels": [
            "https://t.me/ios201F23TIC",
            "https://t.me/ios2011b",
            "https://t.me/ios201_204_AJ_F23"
        ],
        "sources": []
    },
    {
        "name": "IIS202",
        "semester": "current",
        "notes": "محاضرات المادة : د.جمال محمود او د.محمد الدسوقي + ملفات المقرر",
        "content": "يهدف المقرر إلى تعميق معرفتك بلغة SQL، حيث ستتعلم كيفية كتابة استعلامات معقدة، واستخدام الوظائف المتقدمة، والإجراءات المخزنة لمعالجة البيانات وتحليلها بكفاءة عالية.",
        "exam": "امتحان هذه المادة يتكون من 20 لل 25 سؤال مؤتمت ويصنف بمستوى صعوبة متوسط . الامتحان لا يتطلب كتابة اكواد بل يركز بشكل اساسي على الجانب التحليلي حيث سيعرض لك اسئلة تحتوي على استعلامات SQL او مقاطع برمجية جاهزة ويتطلب منك الاجابة على سؤال يتعلق بها مثل تحليل نتيجتها او تحديد وظيفتها او اكتشاف الخطأ فيها",
        "channels": [
            "https://t.me/Akram_IIS202_IIS303",
            "https://t.me/IIS202_TIC_IIS303_BAIT_MXM",
            "https://t.me/TIC_iis202_S23"
        ],
        "sources": [
            "https://youtube.com/playlist?list=PL1DUmTEdeA6J6oDLTveTt4Z7E5qEfFluE&si=Nuc8Na238E_O2Qtb"
        ]
    },
    {
        "name": "IOS202",
        "semester": "current",
        "notes": "محاضرات المادة : د.الياس حبي \n او مقرر المادة او ملخص الزميلة الاء عرابي\nاو حل اسئلة قنوات الاختبار",
        "content": "يركز هذا المقرر على إدارة بيئات العمل والخوادم التي تعمل بنظام تشغيل Windows Server. ستكتسب مهارات عملية في إدارة الشبكات، المستخدمين، والخدمات الأساسية في بيئة ويندوز.",
        "exam": "يتكون من 25 سؤال نظري بالكامل وهو يعتمد بشكل اساسي على الفهم العميق وليس فقط الحفظ . ويصنف مستواه بين السهل والمتوسط . مع اشارة الى ان بعض الاسئلة الدورات السابقة قد تتكرر ولكن ليس شرطا ان تاتي بالحرفية",
        "channels": [
            "https://t.me/IOS202test"
        ],
        "sources": [
            "https://youtube.com/playlist?list=PLDxVq3TlR9y2sMXaL_yLp-r6pUpevgC-w&si=jDvNV4jwmjwLw6n_"
        ]
    },
    {
        "name": "IOS203",
        "semester": "current",
        "notes": "محاضرات الدكتور رداد الكنج او الدكتور نعمان فلوح او مقرر المادة",
        "content": "ستتعلم في هذا المقرر أساسيات إدارة أنظمة التشغيل المستندة إلى Linux، بما في ذلك التعامل مع سطر الأوامر، إدارة الملفات والصلاحيات، وتثبيت البرامج، وهي مهارات أساسية للعمل مع الخوادم.",
        "exam": "يتكون من 35 الى 40 سؤال وهو يعتمد بشكل اساسي على الفهم وليس الحفظ فقط . ويصنف مستواه بانه متوسط مع الاشارة الى ان بعض الاسئلة الدورات السابقة قد تتكرر ولكن ليس شرطا ان تأتي بالحرفية",
        "channels": [
            "https://t.me/IOS203_AM",
            "https://t.me/IOS203test",
            "https://t.me/ios203_AA_S24"
        ],
        "sources": [
            "https://youtube.com/playlist?list=PLT98CRl2KxKHjHLIHrmmi5FmBGIZ8cNJE&si=HhaXcRMp9R7II5m1"
        ]
    },
    {
        "name": "IPG201",
        "semester": "next",
        "notes": "محاضرات الدكتورة هويدا او محمد الخباز و دراسة الملفات وحل اسئلة اختبار",
        "content": "يركز المقرر على تطوير تطبيقات ذات واجهات مستخدم رسومية (GUI). ستتعلم كيفية تصميم النوافذ والأزرار والقوائم، وبرمجة استجابة التطبيق لتفاعلات المستخدم مثل نقرات الفأرة أو إدخال النص.",
        "exam": "يعد امتحان مادة البرمجة المعتمدة على الاحداث متوسط الصعوبة ويحتاج ال تركيز ودقة في الاجابة . اذ يجمع بين الاسئلة النظرية والعلمية التي تقيس فهم الطالب للمفاهيم الاساسية والتطبيقات البرمجية . ويتكون الامتحان عادة من 25 الى 30 سؤال وقد يزيد عددها في بعض الدورات الامحانية",
        "channels": [
            "https://t.me/Akram_IPG201_IPG203",
            "https://t.me/IPG201_TIC_IPG203_BAIT_MXM"
        ],
        "sources": [
            "https://youtube.com/playlist?list=PLHIfW1KZRIfnbNoGB0NdoRdllq9fdo6uM&si=ICq_-MMX2WuXwrXp"
        ]
    },
    {
        "name": "IIS303",
        "semester": "next",
        "notes": "محاضرات الدكتور فادي بشكل اساسي و مقرر المادة الجديد و قنوات الاختبار",
        "content": "يوفر هذا المقرر المهارات اللازمة لإدارة وصيانة أنظمة قواعد بيانات Microsoft SQL Server. ستغطي موضوعات مثل التثبيت، النسخ الاحتياطي والاستعادة، مراقبة الأداء، وتطبيق سياسات الأمان.",
        "exam": "نظرا لان هذا الامتحان الاول الذي يجرى تحت اشراف المنسق الجديد لذلكح لا توجد اي معلومات او نماذج سابقة",
        "channels": [
            "https://t.me/IIS303_New",
            "https://t.me/iis303_404_AJ_S24"
        ],
        "sources": []
    },
    {
        "name": "IIS203",
        "semester": "next",
        "notes": "محاضرات الدكتور جمال بطيخ و اسئلة الشابترات وقنوات الاختبار",
        "content": "يركز المقرر على إدارة أنظمة قواعد بيانات Oracle، التي تستخدم على نطاق واسع في المؤسسات الكبرى. ستتعلم بنيتها المعمارية، وأدوات إدارتها، وكيفية تنفيذ مهام الصيانة والأمان الأساسية.",
        "exam": "يتألف الامتحان من 20 ل 25 سؤال نظريا وتتميز معظم الاسئلة بكونها مأخوذة بشكل حرفي من الشابترات بالاضافة الى ذلك يتضمن الامتحان قسم مقالي يتكون من 3 ل 4 اسئلة ويخصص لهذا القسم 20 او 21 علامة من اجمالي الدرجة",
        "channels": [
            "https://t.me/iis203TestCH",
            "https://t.me/IIS203_R_S"
        ],
        "sources": [
            "https://youtube.com/playlist?list=PL1KA7P5hJ-obwTDetMyuMNUzkwTm-M6tG&si=1HrT8NxTXZpFF5IJ"
        ]
    },
    {
        "name": "IPG204",
        "semester": "next",
        "notes": "محاضرات الدكتور محمد مازن مصطفى و مقرر المادة وملخص امل عثمان و حل اسئلة الاختبار",
        "content": "يقدم المقرر المفاهيم الأساسية لتطوير التطبيقات على الهواتف المحمولة. ستتعرف على خصائص بيئات الموبايل المختلفة، ودورة حياة التطبيق، وكيفية تصميم واجهات مستخدم مناسبة للشاشات الصغيرة.",
        "exam": "يتألف الامتحان من 35 الى 40 وتتنوع طبيعة الاسئلة لتشمل مزيجا من الاسئلة النظرية وسيناريوهات تطبيقية بالاضافة الى بعض الاسئلة المتعلقة بالسكريبتات . يعتمد مستوى صعوبة الامتحان بشكل مباشر على جودة الدراسة : الطالب الذي حضر بشكل جيد وكاف سيجد مستواه يتراوح بين السهل والمتوسط . اما في حال عدم الدراسة بشكل كاف . فسيكون المستوى متوسط يميل للصعب",
        "channels": [
            "https://t.me/Akram_IPG204",
            "https://t.me/IPG204_IWB303_AA_S24"
        ],
        "sources": [
            "https://youtube.com/playlist?list=PLCInYL3l2AajYlZGzU_LVrHdoouf8W6ZN&si=rN0HhY54jyRFYgVu"
        ]
    },
    {
        "name": "IPI201 _ مشروع التخرج",
        "semester": "next",
        "notes": "لا يوجد",
        "content": "في هذا المقرر التطبيقي، ستقوم بتوظيف جميع المهارات والمعارف التي اكتسبتها خلال دراستك لتطوير مشروع برمجي متكامل. ستمر بكافة مراحل تطوير البرمجيات، بدءًا من التحليل ووضع المتطلبات، وصولًا إلى التصميم والتنفيذ والاختبار، مما يمنحك خبرة عملية تحاكي بيئة العمل الحقيقية سواء قمت بتصميم موقع وب او تطبيق موبايل او تطبيق ديسكتوب....الخ",
        "exam": "",
        "channels": [],
        "sources": []
    }
]